Repository: IBMStreams/streamsx.sttgateway
Catalog: com.ibm.streamsx.sttgateway/impl/*/*/SttGatewayResource.xlf
Languages: fr_fr, it_it, ja_jp, zh_cn

# CDIST3800E
source: {0} operator cannot be used inside a consistent region.
fr_fr: L''opérateur {0} ne peut pas être utilisé à l''intérieur d''une région cohérente.
it_it: L''operatore {0} non può essere utilizzato all''interno di una regione congruente.
ja_jp: {0} オペレーターを consistent region の内部で使用することはできません。
zh_cn: 不能在一致区域内使用 {0} 运算符。

# CDIST3801E
source: Operator {0}: The required input tuple attribute ''{1}'' is missing in the first input port.
fr_fr: Opérateur {0} : l''attribut de bloc de données d''entrée requis ''{1}'' ne figure pas dans le premier port d''entrée.
it_it: Operatore {0}: l''attributo di tupla di input richiesto ''{1}'' nella prima porta di input risulta mancante.
ja_jp: オペレーター {0}: 必須の入力タプル属性 ''{1}'' が最初の入力ポートにありません。
zh_cn: 操作程序 {0}：第一个输入端口中缺少必需输入元组属性“{1}”。

# CDIST3802E
source: Operator {0}: The required input tuple attribute ''{1}'' is not of type ''{2}'' or ''{3}'' in the first input port.
fr_fr: Opérateur {0} : l''attribut de bloc de données d''entrée requis ''{1}'' n''est pas de type ''{2}'' ou ''{3}'' dans le premier port d''entrée.
it_it: Operatore {0}: l''attributo di tupla di input richiesto ''{1}'' non è di tipo ''{2}'' o ''{3}'' nella prima porta di input.
ja_jp: オペレーター {0}: 必須の入力タプル属性 ''{1}'' が、最初の入力ポートでタイプ ''{2}'' または ''{3}'' ではありません。
zh_cn: 操作程序 {0}：第一个输入端口中的必需输入元组属性“{1}”的类型不是“{2}”或“{3}”。

# CDIST3803E
source: Operator {0}: The required input tuple attribute ''{1}'' is missing in the second input port.
fr_fr: Opérateur {0} : l''attribut de bloc de données d''entrée requis ''{1}'' ne figure pas dans le second port d''entrée.
it_it: Operatore {0}: l''attributo di tupla di input richiesto ''{1}'' nella seconda porta di input risulta mancante.
ja_jp: オペレーター {0}: 必須の入力タプル属性 ''{1}'' が 2 番目の入力ポートにありません。
zh_cn: 操作程序 {0}：第二个输入端口中缺少必需输入元组属性“{1}”。

# CDIST3804E
source: Operator {0}: The required input tuple attribute ''{1}'' is not of type ''{2}'' in the second input port.
fr_fr: Opérateur {0} : l''attribut de bloc de données d''entrée requis ''{1}'' n''est pas de type ''{2}'' dans le second port d''entrée.
it_it: Operatore {0}: l''attributo di tupla di input richiesto ''{1}'' non è di tipo ''{2}'' nella seconda porta di input.
ja_jp: オペレーター {0}: 必須の入力タプル属性 ''{1}'' が、2 番目の入力ポートでタイプ ''{2}'' ではありません。
zh_cn: 操作程序 {0}：第二个输入端口中的必需输入元组属性“{1}”的类型不是“{2}”。

# CDIST3805E
source: Operator {0}: The required output tuple attribute ''{1}'' is missing in the first output port.
fr_fr: Opérateur {0} : l''attribut de bloc de données de sortie requis ''{1}'' ne figure pas dans le premier port de sortie.
it_it: Operatore {0}: l''attributo di tupla di output richiesto ''{1}'' nella prima porta di output risulta mancante.
ja_jp: オペレーター {0}: 必須の出力タプル属性 ''{1}'' が最初の出力ポートにありません。
zh_cn: 操作程序 {0}：第一个输出端口中缺少必需输出元组属性“{1}”。

# CDIST3806E
source: Operator {0}: The required output tuple attribute ''{1}'' is not of type ''{2}'' in the first output port.
fr_fr: Opérateur {0} : l''attribut de bloc de données de sortie requis ''{1}'' n''est pas de type ''{2}'' dans le premier port de sortie.
it_it: Operatore {0}: l''attributo di tupla di output richiesto ''{1}'' non è di tipo ''{2}'' nella prima porta di output.
ja_jp: オペレーター {0}: 必須の出力タプル属性 ''{1}'' が、最初の出力ポートでタイプ ''{2}'' ではありません。
zh_cn: 操作程序 {0}：第一个输出端口中的必需输出元组属性“{1}”的类型不是“{2}”。

# CDIST3807E
source: Operator {0}: The required output tuple attribute ''{1}'' is missing in the second output port.
fr_fr: Opérateur {0} : l''attribut de bloc de données de sortie requis ''{1}'' ne figure pas dans le second port de sortie.
it_it: Operatore {0}: l''attributo di tupla di output richiesto ''{1}'' nella seconda porta di output risulta mancante.
ja_jp: オペレーター {0}: 必須の出力タプル属性 ''{1}'' が 2 番目の出力ポートにありません。
zh_cn: 操作程序 {0}：第二个输出端口中缺少必需输出元组属性“{1}”。

# CDIST3808E
source: Operator {0}: The required output tuple attribute ''{1}'' is not of type ''{2}'' in the second output port.
fr_fr: Opérateur {0} : l''attribut de bloc de données de sortie requis ''{1}'' n''est pas de type ''{2}'' dans le second port de sortie.
it_it: Operatore {0}: l''attributo di tupla di output richiesto ''{1}'' non è di tipo ''{2}'' nella seconda porta di output.
ja_jp: オペレーター {0}: 必須の出力タプル属性 ''{1}'' が、2 番目の出力ポートでタイプ ''{2}'' ではありません。
zh_cn: 操作程序 {0}：第二个输出端口中的必需输出元组属性“{1}”的类型不是“{2}”。

# CDIST3809E
source: Operator {0}: Invalid value of {1} is given for the sttResultMode parameter. Valid value must be either 1 or 2 or 3.
fr_fr: Opérateur {0} : valeur non valide {1} indiquée au paramètre sttResultMode. La valeur valide doit être 1, 2 ou 3.
it_it: Operatore {0}: il valore non valido di {1} è fornito per il parametro sttResultMode. Il valore valido deve essere 1 o 2 o 3.
ja_jp: オペレーター {0}: {1} という無効な値が sttResultMode パラメーターに指定されています。有効な値は、1、2、または 3 のいずれかです。
zh_cn: 操作程序 {0}：为 sttResultMode 参数指定的值 {1} 无效。有效值必须为 1、2 或 3。

# CDIST3810E
source: Operator {0}: Invalid value of {1} is given for the maxUtteranceAlternatives parameter. Valid value must be greater than 0.
fr_fr: Opérateur {0} : valeur non valide {1} indiquée au paramètre maxUtteranceAlternatives. La valeur valide doit être supérieure à 0.
it_it: Operatore {0}: il valore non valido di {1} è fornito per il parametro maxUtteranceAlternatives. Il valore valido deve essere maggiore di 0.
ja_jp: オペレーター {0}: {1} という無効な値が maxUtteranceAlternatives パラメーターに指定されています。有効な値は 0 より大きい値でなければなりません。
zh_cn: 操作程序 {0}：为 maxUtteranceAlternatives 参数指定的值 {1} 无效。有效值必须大于 0。

# CDIST3811E
source: Operator {0}: Invalid value of {1} is given for the {2} parameter. Valid value must be greater than or equal to 0.0 and less than 1.0.
fr_fr: Opérateur {0} : valeur non valide {1} indiquée au paramètre {2}. La valeur valide doit être supérieure ou égale à 0,0 et inférieure à 1,0.
it_it: Operatore {0}: il valore non valido di {1} è fornito per il parametro {2}. Il valore valido deve essere maggiore o uguale a 0.0 e minore di 1.0.
ja_jp: オペレーター {0}: {1} という無効な値が {2} パラメーターに指定されています。有効な値は 0.0 以上 1.0 未満です。
zh_cn: 操作程序 {0}：为 {2} 参数指定的值 {1} 无效。有效值必须大于或等于 0.0 且小于 1.0。

# CDIST3812E
source: Operator {0}: Invalid value of {1} is given for the {2} parameter. Valid value must be greater than or equal to {3}.
fr_fr: Opérateur {0} : valeur non valide {1} indiquée au paramètre {2}. La valeur valide doit être supérieure ou égale à {3}.
it_it: Operatore {0}: il valore non valido di {1} è fornito per il parametro {2}. Il valore valido deve essere maggiore o uguale a {3}.
ja_jp: オペレーター {0}: {1} という無効な値が {2} パラメーターに指定されています。有効な値は、{3} 以上です。
zh_cn: 操作程序 {0}：为 {2} 参数指定的值 {1} 无效。有效值必须大于或等于 {3}。

# CDIST3813E
source: Operator {0}: Ignoring the received audio data at this time due to an empty IAM access token. User must first provide the IAM access token before sending any audio data to this operator.
fr_fr: Opérateur {0} : les données audio reçues sont ignorées pour l''instant en raison d''un jeton d''accès IAM vide. L''utilisateur doit d''abord fournir le jeton d''accès IAM avant d''envoyer des données audio à cet opérateur.
it_it: Operatore {0}: ignorare i dati audio ricevuti in questo momento a causa di un token di accesso IAM vuoto. L''utente deve fornire il token di accesso IAM prima di inviare dati audio a questo operatore.
ja_jp: オペレーター {0}: IAM アクセス・トークンが空であるため、この時点で受信されたオーディオ・データは無視されます。ユーザーは、このオペレーターにオーディオ・データを送信する前に、まず、IAM アクセス・トークンを指定する必要があります。
zh_cn: 操作程序 {0}：由于 IAM access token 为空，此时将忽略接收到的音频数据。在向此操作程序发送任何音频数据之前，用户必须首先提供 IAM access token。

# CDIST3814E
source: Operator {0} requires a valid value for parameter iamTokenURL or accessToken. But both parameters are empty. Abort!
fr_fr: L''opérateur {0} requiert une valeur valide pour le paramètre iamTokenURL ou accessToken. Or, les deux paramètres sont vides. Abandonnez !
it_it: L''operatore {0} richiede un valore valido per il parametro iamTokenURL o accessToken. Entrambi i parametri sono vuoti. L''operazione viene interrotta.
ja_jp: オペレーター {0} では、iamTokenURL パラメーターまたは accessToken パラメーターに有効な値が必要です。しかし、両方のパラメーターが空です。異常終了します。
zh_cn: 操作程序 {0} 需要参数 iamTokenURL 或 accessToken 的有效值。但这两个参数均为空。异常中止！

# CDIST3815E
source: Operator {0}: Invalid value of {1} is given for the parameter {2} must be greater zero. Abort!
fr_fr: Opérateur {0} : la valeur non valide {1} indiquée au paramètre {2} doit être supérieure à zéro. Abandonnez !
it_it: Operatore {0}: il valore non valido di {1} fornito per il parametro {2} deve essere maggiore zero. L''operazione viene interrotta.
ja_jp: オペレーター {0}: {1} という無効な値がパラメーターに指定されています。{2} はゼロよりも大きい値である必要があります。異常終了します。
zh_cn: 操作程序 {0}：为参数 {2} 指定的值 {1} 无效，值必须大于 0。异常中止！

# CDIST3816E
source: Operator {0}: Invalid value of {1} is given for the parameter {2} must be greater or equal zero. Abort!
fr_fr: Opérateur {0} : la valeur non valide {1} indiquée au paramètre {2} doit être supérieure ou égale à zéro. Abandonnez !
it_it: Operatore {0}: il valore non valido di {1} fornito per il parametro {2} deve essere maggiore o uguale a zero. L''operazione viene interrotta.
ja_jp: オペレーター {0}: {1} という無効な値がパラメーターに指定されています。{2} はゼロ以上の値である必要があります。異常終了します。
zh_cn: 操作程序 {0}：为参数 {2} 指定的值 {1} 无效，值必须大于或等于 0。异常中止！
